nxp-appcodehub/an-bidirectional-acdc-mc56f83783/Multimode_Bidir_DCAC_LCL_MC56F83783/board/peripherals.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Peripherals v12.0
processor: MC56F83783
package_id: MC56F83783VLH
mcu_data: ksdk2_0
processor_version: 13.0.2
functionalGroups:
- name: BOARD_InitPeripherals
  UUID: f9f6f4e8-de8e-445b-8e0d-71ccdf9e53ad
  called_from_default_init: true
  selectedCore: core0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/

/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
component:
- type: 'system'
- type_id: 'system_54b53072540eeeb8f8e9343e71f28176'
- global_system_definitions:
  - user_definitions: ''
  - user_includes: ''
  - init_delay_enable: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/

/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
component:
- type: 'uart_cmsis_common'
- type_id: 'uart_cmsis_common_9cb8e302497aa696fdbb5a4fd622c2a8'
- global_USART_CMSIS_common:
  - quick_selection: 'default'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/

/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
component:
- type: 'gpio_adapter_common'
- type_id: 'gpio_adapter_common_57579b9ac814fe26bf95df0a384c36b6'
- global_gpio_adapter_common:
  - quick_selection: 'default'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "peripherals.h"

/***********************************************************************************************************************
 * BOARD_InitPeripherals functional group
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * ADC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'ADC'
- type: 'cadc_reg'
- mode: 'CADC'
- custom_name_enabled: 'false'
- type_id: 'cadc_reg_3aa3a1e7f4a7b23ac90f68072daac258'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'ADC'
- config_sets:
  - fsl_cadc:
    - cadcConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - dualConverterScanMode: 'kCADC_DualConverterWorkAsTriggeredParallel'
      - enableSimultaneousMode: 'true'
      - DMATriggerSource: 'kCADC_DMATriggerSourceAsEndOfScan'
      - powerUpDelay: '26'
      - autoPowerDown: 'false'
      - clockDivisorInt: '4'
      - enableDMA0: 'false'
      - enableStop0: 'false'
      - startConversion0: 'false'
      - enableSYNC0: 'true'
      - manualPowerDownA: 'false'
      - highReferenceA: 'vdda'
      - lowReferenceA: 'vssa'
      - onChipAnalogInputA: 'normal'
      - tempSensorA: 'normal'
      - manualPowerDownB: 'false'
      - highReferenceB: 'vdda'
      - lowReferenceB: 'vssa'
      - onChipAnalogInputB: 'normal'
      - tempSensorB: 'normal'
    - channelConfig:
      - 0:
        - chMode: '0'
      - 1:
        - chMode: '0'
      - 2:
        - chMode: '0'
      - 3:
        - chMode: '0'
      - 4:
        - chMode: '0'
      - 5:
        - chMode: '0'
      - 6:
        - chMode: '0'
      - 7:
        - chMode: '0'
    - inputGainConfig:
      - channels_inputGain_convA:
        - 0:
          - channelGain: '0'
        - 1:
          - channelGain: '0'
        - 2:
          - channelGain: '0'
        - 3:
          - channelGain: '0'
        - 4:
          - channelGain: '0'
        - 5:
          - channelGain: '0'
        - 6:
          - channelGain: '0'
        - 7:
          - channelGain: '0'
        - 8:
          - channelGain: '0'
        - 9:
          - channelGain: '0'
      - channels_inputGain_convB:
        - 0:
          - channelGain: '0'
        - 1:
          - channelGain: '0'
        - 2:
          - channelGain: '0'
        - 3:
          - channelGain: '0'
        - 4:
          - channelGain: '0'
        - 5:
          - channelGain: '0'
        - 6:
          - channelGain: '0'
        - 7:
          - channelGain: '0'
        - 8:
          - channelGain: '0'
        - 9:
          - channelGain: '0'
    - channels_config:
      - 0:
        - sampleName: 'Sample_0'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_1'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_2'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_3'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_4'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_5'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_6'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_7'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_8'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_9'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 10:
        - sampleName: 'Sample_10'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 11:
        - sampleName: 'Sample_11'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 12:
        - sampleName: 'Sample_12'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 13:
        - sampleName: 'Sample_13'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 14:
        - sampleName: 'Sample_14'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 15:
        - sampleName: 'Sample_15'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 16:
        - sampleName: 'Sample_16'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 17:
        - sampleName: 'Sample_17'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 18:
        - sampleName: 'Sample_18'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 19:
        - sampleName: 'Sample_19'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - channels_config_A_parallel:
      - 0:
        - sampleName: 'Sample_0'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_1'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_2'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_3'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_4'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_5'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_6'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_7'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_16'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_17'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - channels_config_B_parallel:
      - 0:
        - sampleName: 'Sample_8'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_9'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_10'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_11'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '2048'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_12'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_13'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_14'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_15'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_18'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_19'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - interrupt:
      - interruptSources: ''
      - enable_err_irq: 'false'
      - interrupt_err:
        - IRQn: 'kADC12_ERR_VECTORn'
        - dsc_enable_interrrupt: 'iprVal0'
        - enable_custom_name: 'false'
      - enable_cc0_irq: 'false'
      - interrupt_cc0:
        - IRQn: 'kADC12_CC0_VECTORn'
        - dsc_enable_interrrupt: 'iprVal1'
        - enable_custom_name: 'false'
      - enable_cc1_irq: 'false'
      - interrupt_cc1:
        - IRQn: 'kADC12_CC1_VECTORn'
        - dsc_enable_interrrupt: 'iprVal0'
        - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

