nxp-appcodehub/an-bidirectional-acdc-mc56f83783/Multimode_Bidir_DCAC_LCL_MC56F83783/board/peripherals.c
/***********************************************************************************************************************
 * CMPC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'CMPC'
- type: 'cmp_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'cmp_reg_3fe3364eca8ece52bd212873a03681c2'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'CMPC'
- config_sets:
  - fsl_filter:
    - filter_config:
      - clockSource: 'SystemClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - filterPeriod: '1'
      - filterCount2: '3'
  - fsl_cmp:
    - main_config:
      - explicitEnableCmp: 'true'
      - filterModes: 'm0'
      - hysteresisMode: 'kCMP_HysteresisLevel0'
      - enableHighSpeed: 'false'
      - enableInvertOutput: 'false'
      - useUnfilteredOutput: 'false'
      - enablePinOut: 'false'
    - positiveChannel: 'IN.7'
    - negativeChannel: 'IN.2'
  - fsl_dac:
    - enableDAC: 'true'
    - dac_config:
      - referenceVoltageSource: 'DAC_8bit_VIN1'
      - DACValue: '233'
  - interrupt:
    - interrupt_sel: ''
    - enableDma: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kCMPA_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void CMPC_init(void) {
  /* Software reset the CMPC. */
  CMPC->CR0   = 0U;
  CMPC->CR1   = 0U;
  CMPC->FPR   = 0U;
  CMPC->SCR   = 0U;
  CMPC->DACCR = 0U;
  CMPC->MUXCR = 0U;
#if defined(CMPC_CR0_INIT)
  CMPC->CR0 = CMPC_CR0_INIT;
#endif /* CMPC_CR0_INIT */
#if defined(CMPC_FPR_INIT)
  CMPC->FPR = CMPC_FPR_INIT;
#endif /* CMPC_FPR_INIT */
#if defined(CMPC_SCR_INIT)
  CMPC->SCR = CMPC_SCR_INIT;
#endif /* CMPC_SCR_INIT */
#if defined(CMPC_DACCR_INIT)
  CMPC->DACCR = CMPC_DACCR_INIT;
#endif /* CMPC_DACCR_INIT */
#if defined(CMPC_MUXCR_INIT)
  CMPC->MUXCR = CMPC_MUXCR_INIT;
#endif /* CMPC_MUXCR_INIT */
#if defined(CMPC_CR1_INIT)
  CMPC->CR1 = CMPC_CR1_INIT;
#endif /* CMPC_CR1_INIT */
}

/***********************************************************************************************************************
 * Flash_configuration initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'Flash_configuration'
- type: 'dsc_flash_config'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'dsc_flash_config_87b8cda2db02ccd1732cf954ffb02af3'
- functional_group: 'BOARD_InitPeripherals'
- config_sets:
  - fcf_config:
    - bcaConfig:
      - crcCheck:
        - crcStartAddress: '0xFFFFFFFF'
        - crcByteCount: '0xFFFFFFFF'
        - crcExpectedValue: '0xFFFFFFFF'
      - enabledPeripherals: 'uart i2c spi can'
      - i2cSlaveAddress: '0xFF'
      - peripheralDetectionTimeout: '0xFFFF'
      - directBootFlag: 'false'
      - canConfig:
        - baudRateConfig: 'auto'
        - canTxId: '0xFFFF'
        - canRxId: '0xFFFF'
    - flashConfig:
      - keyBytes:
        - 0:
          - byteValue: '0xFF'
        - 1:
          - byteValue: '0xFF'
        - 2:
          - byteValue: '0xFF'
        - 3:
          - byteValue: '0xFF'
        - 4:
          - byteValue: '0xFF'
        - 5:
          - byteValue: '0xFF'
        - 6:
          - byteValue: '0xFF'
        - 7:
          - byteValue: '0xFF'
      - protBytes:
        - 0:
          - byteValue: '0xFF'
        - 1:
          - byteValue: '0xFF'
        - 2:
          - byteValue: '0xFF'
        - 3:
          - byteValue: '0xFF'
      - FSEC:
        - SEC: 'unsecure'
        - FSLACC: 'granted'
        - KEYEN: 'false'
        - MEEN: 'true'
      - bootOption: '0'
      - pwrMode: '1'
    - fcf_codegenerator: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/* Empty initialization function (commented out)
static void Flash_configuration_init(void) {
} */

/***********************************************************************************************************************
 * INTC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'INTC'
- type: 'intc_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'intc_reg_5d361a53fef6bec91d1f7c2aeedd895b'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'INTC'
- config_sets:
  - intc:
    - dsc_core_int_level: 'mask_level_0_1_2'
    - interrupt_table:
      - 0: []
      - 1: []
      - 2: []
    - interrupts: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/* Empty initialization function (commented out)
static void INTC_init(void) {
} */

/***********************************************************************************************************************
 * PWMA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'PWMA'
- type: 'pwm_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'pwm_reg_d49946f7b366f6b63d56e6e76fd333cc'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'PWMA'
- config_sets:
  - fsl_pwm:
    - clockSource: 'SystemClock'
    - clockSourceFreq: 'BOARD_BootClockRUN'
    - pllMonitor: '0'
    - submodules:
      - 0:
        - sm: 'kPWM_Module_0'
        - sm_template_params: []
        - config:
          - clockSource: 'kPWM_BusClock'
          - prescale: '0'
          - compareMode: '0'
          - loadOK: 'true'
          - startCounter: 'false'
          - signed_unsigned: 'signed'
          - init: '-2500'
          - val1: '2499'
          - fracval1: '0'
          - val0: '0'
          - val2: '0'
          - fracval2: '0'
          - val3: '0'
          - fracval3: '0'
          - val4: '2491'
          - fracval4: '0'
          - val5: '2491'
          - fracval5: '0'
          - initializationControl: '0'
          - enableDebugMode: 'false'
          - enableWait: 'false'
          - pairOperation: '0'
          - pairMain: '0'
          - deadtime_logic_inputs:
            - pwm23:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
            - pwm45:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
          - deadtime_params:
            - deadTime0:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '0'
            - deadTime1:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '0'
          - reloadControl:
            - reloadImmediate: 'false'
            - reloadLogic: 'kPWM_ReloadPwmFullCycle'
            - reloadSelect: '0'
            - reloadFrequency: '0'
          - forceControl:
            - forceTrigger: '0'
            - pwm23Init: '0'
            - pwm45Init: '0'
            - pwmxInit: '0'
            - forceEn: 'false'
          - fracControl:
            - fracEn: ''
            - powerUp: 'false'
          - doubleSwitching:
            - doubleEn: 'false'
            - doubleX: 'false'
            - split: '0'
          - outputEn: ''
          - outputMask: ''
          - maskImmediately: 'true'
          - outputTrigger_sel: 'kPWM_ValueRegister_4'
          - triggerFrequency: '0'
          - triggerSource0: '0'
          - triggerSource1: '1'
          - interrupt_sel: 'kPWM_CompareVal5InterruptEnable'
          - interrupt_flags: 'kPWM_CompareVal5InterruptFlag'
          - dma_used: 'false'
          - dma:
            - pwmDMA_activate: 'false'
            - captureDMA_enable: ''
            - captureDMA_source: '0'
            - captureDMA_watermark_control: '0'
        - channels:
          - 0:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0 s1 s2'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 1:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0 s1 s2'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 2:
            - functionSel: 'notUsed'
        - compare_interruptEn: 'true'
        - compare_interrupt:
          - IRQn: 'keFlexPWMA_CMP0_VECTORn'
          - dsc_enable_interrrupt: 'iprVal2'
          - enable_custom_name: 'true'
          - handler_custom_name: 'Fast_Ctrl_ISR'
        - reload_interruptEn: 'false'
        - reload_interrupt:
          - IRQn: 'keFlexPWMA_RELOAD0_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
    - faultChannels:
      - 0:
        - commonFaultSetting:
          - clockSource: 'kPWM_BusClock'
          - faultFilterPeriod: '1'
          - faultFilterCount: '3'
          - faultGlitchStretch: 'false'
          - testFault: 'false'
        - faults:
          - 0:
            - faultClearingMode: 'kPWM_Automatic'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_RecoverFullCycle'
            - fault_int_source: 'true'
          - 1:
            - faultClearingMode: 'kPWM_Automatic'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_RecoverFullCycle'
            - fault_int_source: 'true'
          - 2:
            - faultClearingMode: 'kPWM_ManualSafety'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_RecoverFullCycle'
            - fault_int_source: 'false'
          - 3:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
        - fault_template_params: []
      - 1:
        - commonFaultSetting:
          - clockSource: 'kPWM_BusClock'
          - faultFilterPeriod: '0'
          - faultFilterCount: '3'
          - faultGlitchStretch: 'false'
          - testFault: 'false'
        - faults:
          - 0:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 1:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 2:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 3:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
        - fault_template_params: []
    - capture_interruptEn: 'false'
    - capture_interrupt:
      - IRQn: 'keFlexPWMA_CAP_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - fault_interruptEn: 'true'
    - fault_interrupt:
      - IRQn: 'keFlexPWMA_FAULT_VECTORn'
      - dsc_enable_interrrupt: 'iprVal1'
      - enable_custom_name: 'true'
      - handler_custom_name: 'CUR_CBCPro_Cnt_ISR'
    - error_interruptEn: 'false'
    - error_interrupt:
      - IRQn: 'keFlexPWMA_RERR_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - pwm_common_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void PWMA_init(void) {
/****************************************************************************/
/* Submodule 0 initialization */
/****************************************************************************/
  /* Disable the submodule and its output before the submodule init. */
  PWMA->OUTEN &= ~(PWM_OUTEN_PWMA_EN(1U << 0) | PWM_OUTEN_PWMB_EN(1U << 0) | PWM_OUTEN_PWMX_EN(1U << 0));
  PWMA->MCTRL &= ~(PWM_MCTRL_RUN(1U << 0) | PWM_MCTRL_CLDOK(1U << 0));
#ifdef PWMA_SM0CTRL_INIT
  PWMA->SM[0].CTRL = PWMA_SM0CTRL_INIT;
#else
  PWMA->SM[0].CTRL = 0x400U;
#endif /* PWMA_SM0CTRL_INIT */
#ifdef PWMA_SM0CTRL2_INIT
  PWMA->SM[0].CTRL2 = PWMA_SM0CTRL2_INIT;
#else
  PWMA->SM[0].CTRL2 = 0x0U;
#endif /* PWMA_SM0CTRL2_INIT */
#ifdef PWMA_SM0INIT_INIT
  PWMA->SM[0].INIT = PWMA_SM0INIT_INIT;
#else
  PWMA->SM[0].INIT = 0x0U;
#endif /* PWMA_SM0INIT_INIT */
#ifdef PWMA_SM0VAL0_INIT
  PWMA->SM[0].VAL0 = PWMA_SM0VAL0_INIT;
#else
  PWMA->SM[0].VAL0 = 0x0U;
#endif /* PWMA_SM0VAL0_INIT */
#ifdef PWMA_SM0VAL1_INIT
  PWMA->SM[0].VAL1 = PWMA_SM0VAL1_INIT;
#else
  PWMA->SM[0].VAL1 = 0x0U;
#endif /* PWMA_SM0VAL1_INIT */
#ifdef PWMA_SM0VAL2_INIT
  PWMA->SM[0].VAL2 = PWMA_SM0VAL2_INIT;
#else
  PWMA->SM[0].VAL2 = 0x0U;
#endif /* PWMA_SM0VAL2_INIT */
#ifdef PWMA_SM0VAL3_INIT
  PWMA->SM[0].VAL3 = PWMA_SM0VAL3_INIT;
#else
  PWMA->SM[0].VAL3 = 0x0U;
#endif /* PWMA_SM0VAL3_INIT */
#ifdef PWMA_SM0VAL4_INIT
  PWMA->SM[0].VAL4 = PWMA_SM0VAL4_INIT;
#else
  PWMA->SM[0].VAL4 = 0x0U;
#endif /* PWMA_SM0VAL4_INIT */
#ifdef PWMA_SM0VAL5_INIT
  PWMA->SM[0].VAL5 = PWMA_SM0VAL5_INIT;
#else
  PWMA->SM[0].VAL5 = 0x0U;
#endif /* PWMA_SM0VAL5_INIT */
#if (defined(PWMA_SM0_FRACTIONAL_BLOCK_AVAILABLE))
#ifdef PWMA_SM0FRACVAL1_INIT
  PWMA->SM[0].FRACVAL1 = PWMA_SM0FRACVAL1_INIT;
#else
  PWMA->SM[0].FRACVAL1 = 0x0U;
#endif /* PWMA_SM0FRACVAL1_INIT */
#ifdef PWMA_SM0FRACVAL2_INIT
  PWMA->SM[0].FRACVAL2 = PWMA_SM0FRACVAL2_INIT;
#else
  PWMA->SM[0].FRACVAL2 = 0x0U;
#endif /* PWMA_SM0FRACVAL2_INIT */
#ifdef PWMA_SM0FRACVAL3_INIT
  PWMA->SM[0].FRACVAL3 = PWMA_SM0FRACVAL3_INIT;
#else
  PWMA->SM[0].FRACVAL3 = 0x0U;
#endif /* PWMA_SM0FRACVAL3_INIT */
#ifdef PWMA_SM0FRACVAL4_INIT
  PWMA->SM[0].FRACVAL4 = PWMA_SM0FRACVAL4_INIT;
#else
  PWMA->SM[0].FRACVAL4 = 0x0U;
#endif /* PWMA_SM0FRACVAL4_INIT */
#ifdef PWMA_SM0FRACVAL5_INIT
  PWMA->SM[0].FRACVAL5 = PWMA_SM0FRACVAL5_INIT;
#else
  PWMA->SM[0].FRACVAL5 = 0x0U;
#endif /* PWMA_SM0FRACVAL5_INIT */
#ifdef PWMA_SM0FRCTRL_INIT
  PWMA->SM[0].FRCTRL = PWMA_SM0FRCTRL_INIT;
#else
  PWMA->SM[0].FRCTRL = 0x0U;
#endif /* PWMA_SM0FRCTRL_INIT */
#endif /* (defined(PWMA_SM0_FRACTIONAL_BLOCK_AVAILABLE)) */
#ifdef PWMA_SM0OCTRL_INIT
  PWMA->SM[0].OCTRL = PWMA_SM0OCTRL_INIT;
#else
  PWMA->SM[0].OCTRL = 0x0U;
#endif /* PWMA_SM0OCTRL_INIT */
#ifdef PWMA_SM0STS_INIT
  PWMA->SM[0].STS = PWMA_SM0STS_INIT;
#else
  PWMA->SM[0].STS = 0x3fffU;
#endif /* PWMA_SM0STS_INIT */
#ifdef PWMA_SM0INTEN_INIT
  PWMA->SM[0].INTEN = PWMA_SM0INTEN_INIT;
#else
  PWMA->SM[0].INTEN = 0x0U;
#endif /* PWMA_SM0INTEN_INIT */
#ifdef PWMA_SM0DMAEN_INIT
  PWMA->SM[0].DMAEN = PWMA_SM0DMAEN_INIT;
#else
  PWMA->SM[0].DMAEN = 0x0U;
#endif /* PWMA_SM0DMAEN_INIT */
#ifdef PWMA_SM0TCTRL_INIT
  PWMA->SM[0].TCTRL = PWMA_SM0TCTRL_INIT;
#else
  PWMA->SM[0].TCTRL = 0x0U;
#endif /* PWMA_SM0TCTRL_INIT */
#ifdef PWMA_SM0DISMAP0_INIT
  PWMA->SM[0].DISMAP[0] = PWMA_SM0DISMAP0_INIT;
#else
  PWMA->SM[0].DISMAP[0] = 0xffffU;
#endif /* PWMA_SM0DISMAP0_INIT */
#ifdef PWMA_SM0DISMAP1_INIT
  PWMA->SM[0].DISMAP[1] = PWMA_SM0DISMAP1_INIT;
#else
  PWMA->SM[0].DISMAP[1] = 0xffffU;
#endif /* PWMA_SM0DISMAP1_INIT */
#ifdef PWMA_SM0DTCNT0_INIT
  PWMA->SM[0].DTCNT0 = PWMA_SM0DTCNT0_INIT;
#else
  PWMA->SM[0].DTCNT0 = 0x7ffU;
#endif /* PWMA_SM0DTCNT0_INIT */
#ifdef PWMA_SM0DTCNT1_INIT
  PWMA->SM[0].DTCNT1 = PWMA_SM0DTCNT1_INIT;
#else
  PWMA->SM[0].DTCNT1 = 0x7ffU;
#endif /* PWMA_SM0DTCNT1_INIT */
#ifdef PWM_CAPTCTRLA_EDGA0_MASK
#ifdef PWMA_SM0CAPTCTRLA_INIT
  PWMA->SM[0].CAPTCTRLA = PWMA_SM0CAPTCTRLA_INIT;
#else
  PWMA->SM[0].CAPTCTRLA = 0x0U;
#endif /* PWMA_SM0CAPTCTRLA_INIT */
#ifdef PWMA_SM0CAPTCOMPA_INIT
  PWMA->SM[0].CAPTCOMPA = PWMA_SM0CAPTCOMPA_INIT;
#else
  PWMA->SM[0].CAPTCOMPA = 0x0U;
#endif /* PWMA_SM0CAPTCOMPA_INIT */
#endif /* PWM_CAPTCTRLA_EDGA0_MASK */
#ifdef PWM_CAPTCTRLB_EDGB0_MASK
#ifdef PWMA_SM0CAPTCTRLB_INIT
  PWMA->SM[0].CAPTCTRLB = PWMA_SM0CAPTCTRLB_INIT;
#else
  PWMA->SM[0].CAPTCTRLB = 0x0U;
#endif /* PWMA_SM0CAPTCTRLB_INIT */
#ifdef PWMA_SM0CAPTCOMPB_INIT
  PWMA->SM[0].CAPTCOMPB = PWMA_SM0CAPTCOMPB_INIT;
#else
  PWMA->SM[0].CAPTCOMPB = 0x0U;
#endif /* PWMA_SM0CAPTCOMPB_INIT */
#endif /* PWM_CAPTCTRLB_EDGB0_MASK */
#ifdef PWM_CAPTCTRLX_EDGX0_MASK
#ifdef PWMA_SM0CAPTCTRLX_INIT
  PWMA->SM[0].CAPTCTRLX = PWMA_SM0CAPTCTRLX_INIT;
#else
  PWMA->SM[0].CAPTCTRLX = 0x0U;
#endif /* PWMA_SM0CAPTCTRLX_INIT */
#ifdef PWMA_SM0CAPTCOMPX_INIT
  PWMA->SM[0].CAPTCOMPX = PWMA_SM0CAPTCOMPX_INIT;
#else
  PWMA->SM[0].CAPTCOMPX = 0x0U;
#endif /* PWMA_SM0CAPTCOMPX_INIT */
#endif /* PWM_CAPTCTRLX_EDGX0_MASK */
#if (0 != 0)
#ifdef PWM_PHASEDLY_PHASEDLY_MASK
#ifdef PWMA_SM0PHASEDLY_INIT
  PWMA->SM[0].PHASEDLY = PWMA_SM0PHASEDLY_INIT;
#else
  PWMA->SM[0].PHASEDLY = 0x0U;
#endif /* PWMA_SM0PHASEDLY_INIT */
#endif /* PWM_PHASEDLY_PHASEDLY_MASK */
#endif /* (0 != 0) */
#if ((!defined(PWMA_SM0CTRL_INIT)) || (0U == (PWMA_SM0CTRL_INIT & PWM_CTRL_LDMOD_MASK)))
  PWMA->MCTRL |= PWM_MCTRL_LDOK(1U << 0);
#endif /* ((!defined(PWMA_SM0CTRL_INIT)) || (0U == (PWMA_SM0CTRL_INIT & PWM_CTRL_LDMOD_MASK))) */
/****************************************************************************/
/* Fault channel0 initialization */
/****************************************************************************/
  /* Fault setting are shared for all submodules, it is allowed to initiate it in each
     initialization function, but suggest to initiate it only once. */
#ifdef PWMA_FCTRL0_INIT
  PWMA->FAULT[0].FCTRL = PWMA_FCTRL0_INIT;
#else
  PWMA->FAULT[0].FCTRL = 0x0U;
#endif /* PWMA_FCTRL0_INIT */
#ifdef PWMA_FSTS0_INIT
  PWMA->FAULT[0].FSTS = PWMA_FSTS0_INIT;
#else
  PWMA->FAULT[0].FSTS = 0xfU;
#endif /* PWMA_FSTS0_INIT */
#ifdef PWMA_FFILT0_INIT
  PWMA->FAULT[0].FFILT = PWMA_FFILT0_INIT;
#else
  PWMA->FAULT[0].FFILT = 0x0U;
#endif /* PWMA_FFILT0_INIT */
#ifdef PWMA_FTST0_INIT
  PWMA->FAULT[0].FTST = PWMA_FTST0_INIT;
#else
  PWMA->FAULT[0].FTST = 0x0U;
#endif /* PWMA_FTST0_INIT */
#ifdef PWM_FCTRL2_NOCOMB_MASK
#ifdef PWMA_FCTRL20_INIT
  PWMA->FAULT[0].FCTRL2 = PWMA_FCTRL20_INIT;
#else
  PWMA->FAULT[0].FCTRL2 = 0x0U;
#endif /* PWMA_FCTRL20_INIT */
#endif /* PWM_FCTRL2_NOCOMB_MASK */

