nxp-appcodehub/an-bidirectional-acdc-mc56f83783/Multimode_Bidir_DCAC_LCL_MC56F83783/board/peripherals.c
/****************************************************************************/
/* Fault channel1 initialization */
/****************************************************************************/
  /* Fault setting are shared for all submodules, it is allowed to initiate it in each
     initialization function, but suggest to initiate it only once. */
#ifdef PWMA_FCTRL1_INIT
  PWMA->FAULT[1].FCTRL = PWMA_FCTRL1_INIT;
#else
  PWMA->FAULT[1].FCTRL = 0x0U;
#endif /* PWMA_FCTRL1_INIT */
#ifdef PWMA_FSTS1_INIT
  PWMA->FAULT[1].FSTS = PWMA_FSTS1_INIT;
#else
  PWMA->FAULT[1].FSTS = 0xfU;
#endif /* PWMA_FSTS1_INIT */
#ifdef PWMA_FFILT1_INIT
  PWMA->FAULT[1].FFILT = PWMA_FFILT1_INIT;
#else
  PWMA->FAULT[1].FFILT = 0x0U;
#endif /* PWMA_FFILT1_INIT */
#ifdef PWMA_FTST1_INIT
  PWMA->FAULT[1].FTST = PWMA_FTST1_INIT;
#else
  PWMA->FAULT[1].FTST = 0x0U;
#endif /* PWMA_FTST1_INIT */
#ifdef PWM_FCTRL2_NOCOMB_MASK
#ifdef PWMA_FCTRL21_INIT
  PWMA->FAULT[1].FCTRL2 = PWMA_FCTRL21_INIT;
#else
  PWMA->FAULT[1].FCTRL2 = 0x0U;
#endif /* PWMA_FCTRL21_INIT */
#endif /* PWM_FCTRL2_NOCOMB_MASK */

/****************************************************************************/
/* PWMA initialization */
/****************************************************************************/
#ifdef PWMA_OUTEN_INIT
  PWMA->OUTEN = (PWMA->OUTEN & (~PWMA_OUTEN_INIT_MASK)) | (PWMA_OUTEN_INIT & PWMA_OUTEN_INIT_MASK);
#endif /* PWMA_PWMA_OUTEN_INIT */
#ifdef PWMA_MASK_INIT
  PWMA->MASK = (PWMA->MASK & (~PWMA_MASK_INIT_MASK)) | (PWMA_MASK_INIT & PWMA_MASK_INIT_MASK);
#endif /* PWMA_PWMA_MASK_INIT */
#ifdef PWMA_SWCOUT_INIT
  PWMA->SWCOUT = (PWMA->SWCOUT & (~PWMA_SWCOUT_INIT_MASK)) | (PWMA_SWCOUT_INIT & PWMA_SWCOUT_INIT_MASK);
#endif /* PWMA_PWMA_SWCOUT_INIT */
#ifdef PWMA_DTSRCSEL_INIT
  PWMA->DTSRCSEL = (PWMA->DTSRCSEL & (~PWMA_DTSRCSEL_INIT_MASK)) | (PWMA_DTSRCSEL_INIT & PWMA_DTSRCSEL_INIT_MASK);
#endif /* PWMA_PWMA_DTSRCSEL_INIT */
#ifdef PWMA_MCTRL2_INIT
  PWMA->MCTRL2 = PWMA_MCTRL2_INIT;
#endif /* PWMA_PWMA_MCTRL2_INIT */
#ifdef PWMA_MCTRL_INIT
  PWMA->MCTRL = (PWMA->MCTRL & (~PWMA_MCTRL_INIT_MASK)) | (PWMA_MCTRL_INIT & PWMA_MCTRL_INIT_MASK);
#endif /* PWMA_PWMA_MCTRL_INIT */
#ifdef PWMA_SM0CTRL_INIT
#if ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[0].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM0CTRL_INIT */
#ifdef PWMA_SM1CTRL_INIT
#if ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[1].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM1CTRL_INIT */
#ifdef PWMA_SM2CTRL_INIT
#if ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[2].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM2CTRL_INIT */
#ifdef PWMA_SM3CTRL_INIT
#if ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[3].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM3CTRL_INIT */
}

/***********************************************************************************************************************
 * CMPB initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'CMPB'
- type: 'cmp_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'cmp_reg_3fe3364eca8ece52bd212873a03681c2'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'CMPB'
- config_sets:
  - fsl_filter:
    - filter_config:
      - clockSource: 'SystemClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - filterPeriod: '1'
      - filterCount2: '3'
  - fsl_cmp:
    - main_config:
      - explicitEnableCmp: 'true'
      - filterModes: 'm0'
      - hysteresisMode: 'kCMP_HysteresisLevel0'
      - enableHighSpeed: 'false'
      - enableInvertOutput: 'false'
      - useUnfilteredOutput: 'false'
      - enablePinOut: 'false'
    - positiveChannel: 'IN.0'
    - negativeChannel: 'IN.7'
  - fsl_dac:
    - enableDAC: 'true'
    - dac_config:
      - referenceVoltageSource: 'DAC_8bit_VIN1'
      - DACValue: '63'
  - interrupt:
    - interrupt_sel: ''
    - enableDma: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kCMPA_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void CMPB_init(void) {
  /* Software reset the CMPB. */
  CMPB->CR0   = 0U;
  CMPB->CR1   = 0U;
  CMPB->FPR   = 0U;
  CMPB->SCR   = 0U;
  CMPB->DACCR = 0U;
  CMPB->MUXCR = 0U;
#if defined(CMPB_CR0_INIT)
  CMPB->CR0 = CMPB_CR0_INIT;
#endif /* CMPB_CR0_INIT */
#if defined(CMPB_FPR_INIT)
  CMPB->FPR = CMPB_FPR_INIT;
#endif /* CMPB_FPR_INIT */
#if defined(CMPB_SCR_INIT)
  CMPB->SCR = CMPB_SCR_INIT;
#endif /* CMPB_SCR_INIT */
#if defined(CMPB_DACCR_INIT)
  CMPB->DACCR = CMPB_DACCR_INIT;
#endif /* CMPB_DACCR_INIT */
#if defined(CMPB_MUXCR_INIT)
  CMPB->MUXCR = CMPB_MUXCR_INIT;
#endif /* CMPB_MUXCR_INIT */
#if defined(CMPB_CR1_INIT)
  CMPB->CR1 = CMPB_CR1_INIT;
#endif /* CMPB_CR1_INIT */
}

/***********************************************************************************************************************
 * CMPA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'CMPA'
- type: 'cmp_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'cmp_reg_3fe3364eca8ece52bd212873a03681c2'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'CMPA'
- config_sets:
  - fsl_filter:
    - filter_config:
      - clockSource: 'SystemClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - filterPeriod: '1'
      - filterCount2: '3'
  - fsl_cmp:
    - main_config:
      - explicitEnableCmp: 'true'
      - filterModes: 'm0'
      - hysteresisMode: 'kCMP_HysteresisLevel0'
      - enableHighSpeed: 'false'
      - enableInvertOutput: 'false'
      - useUnfilteredOutput: 'false'
      - enablePinOut: 'false'
    - positiveChannel: 'IN.7'
    - negativeChannel: 'IN.3'
  - fsl_dac:
    - enableDAC: 'true'
    - dac_config:
      - referenceVoltageSource: 'DAC_8bit_VIN1'
      - DACValue: '192'
  - interrupt:
    - interrupt_sel: ''
    - enableDma: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kCMPA_VECTORn'
      - dsc_enable_interrrupt: 'iprVal1'
      - enable_custom_name: 'true'
      - handler_custom_name: 'INV_CBC_CNT_ISR'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void CMPA_init(void) {
  /* Software reset the CMPA. */
  CMPA->CR0   = 0U;
  CMPA->CR1   = 0U;
  CMPA->FPR   = 0U;
  CMPA->SCR   = 0U;
  CMPA->DACCR = 0U;
  CMPA->MUXCR = 0U;
#if defined(CMPA_CR0_INIT)
  CMPA->CR0 = CMPA_CR0_INIT;
#endif /* CMPA_CR0_INIT */
#if defined(CMPA_FPR_INIT)
  CMPA->FPR = CMPA_FPR_INIT;
#endif /* CMPA_FPR_INIT */
#if defined(CMPA_SCR_INIT)
  CMPA->SCR = CMPA_SCR_INIT;
#endif /* CMPA_SCR_INIT */
#if defined(CMPA_DACCR_INIT)
  CMPA->DACCR = CMPA_DACCR_INIT;
#endif /* CMPA_DACCR_INIT */
#if defined(CMPA_MUXCR_INIT)
  CMPA->MUXCR = CMPA_MUXCR_INIT;
#endif /* CMPA_MUXCR_INIT */
#if defined(CMPA_CR1_INIT)
  CMPA->CR1 = CMPA_CR1_INIT;
#endif /* CMPA_CR1_INIT */
}

