nxp-appcodehub/an-bidirectional-acdc-mc56f83783/Multimode_Bidir_DCAC_LCL_MC56F83783/board/peripherals.c
/***********************************************************************************************************************
 * QSCI1 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'QSCI1'
- type: 'qsci_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'qsci_reg_2d9323f68f6773d3646d5e49c6c75606'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'QSCI1'
- config_sets:
  - fsl_qsci:
    - qsciConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - DividerBaudRateStr: '868'
      - parityEnable: 'false'
      - parityMode: '0'
      - dataBitCount: '0'
      - polarityMode: '0'
      - fifoEn: 'false'
      - txFifoWatermark: '0'
      - rxFifoWatermark: '1'
      - enableTx: 'true'
      - enableRx: 'true'
      - LINSlaveEnable: 'false'
      - LoopEnable: 'false'
      - ReceiverSource: '0'
      - WaitEnable: 'false'
      - StopHoldEnable: 'false'
      - StandbyEnable: 'false'
      - WakeUpCondition: '0'
      - txDMAEn: 'false'
      - rxDMAEn: 'false'
      - interrupt_vectors:
        - interrupt_types: ''
        - enable_tx_irq: 'false'
        - interrupt_tx:
          - IRQn: 'kQSCI0_TDRE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_rx_irq: 'false'
        - interrupt_rx:
          - IRQn: 'kQSCI0_RCV_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_rx_err_irq: 'false'
        - interrupt_rx_err:
          - IRQn: 'kQSCI0_RERR_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_tridle_irq: 'false'
        - interrupt_tridle:
          - IRQn: 'kQSCI0_TRIDLE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
    - qsci_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void QSCI1_init(void) {
/****************************************************************************/
/* QSCI1 initialization */
/****************************************************************************/
  /* Software peripheral reset to a known state. */
  SIM->PSWR1 |= SIM_PSWR1_SCI1_MASK;
  SIM->PSWR1 &= ~ SIM_PSWR1_SCI1_MASK;
#if defined(QSCI1_RATE_INIT)
  QSCI1->RATE = QSCI1_RATE_INIT;
#endif /* QSCI1_RATE_INIT */
#if defined(QSCI1_CTRL2_INIT)
  QSCI1->CTRL2 = QSCI1_CTRL2_INIT;
#endif /* QSCI1_CTRL2_INIT */
#if defined(QSCI1_CTRL3_INIT)
  QSCI1->CTRL3 = QSCI1_CTRL3_INIT;
#endif /* QSCI1_CTRL3_INIT */
#if defined(QSCI1_CTRL1_INIT)
  QSCI1->CTRL1 = QSCI1_CTRL1_INIT;
#endif /* QSCI1_CTRL1_INIT */

}

/***********************************************************************************************************************
 * PIT0 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'PIT0'
- type: 'pit_reg'
- mode: 'PIT_GENERAL'
- custom_name_enabled: 'false'
- type_id: 'pit_reg_6035bba38bcf2931406cb9b038081d5d'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'PIT0'
- config_sets:
  - pit_reg:
    - clock_config:
      - clockSource: 'kAltClock0'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - prescaler: 'p0'
      - modulo: '50000'
    - slaveMode: 'false'
    - enableCounter: 'false'
    - enableRollOverInterruptSource: 'true'
    - enable_irq: 'true'
    - interrupt:
      - IRQn: 'kPIT0_ROLLOVR_VECTORn'
      - dsc_enable_interrrupt: 'iprVal1'
      - enable_custom_name: 'true'
      - handler_custom_name: 'PFC_VolCtrl_ISR'
    - pit_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void PIT0_init(void) {
/****************************************************************************/
/* PIT0 initialization */
/****************************************************************************/
    /* Software reset PIT0. */
    SIM->PSWR2 |= SIM_PSWR2_PIT0_MASK;
    SIM->PSWR2 &= ~ SIM_PSWR2_PIT0_MASK;

#if defined(PIT0_MOD_L_INIT) && defined(PIT0_MOD_H_INIT)
    PIT0->MOD_L = PIT0_MOD_L_INIT;
    PIT0->MOD_H = PIT0_MOD_H_INIT;
#endif
#if defined(PIT0_MOD_INIT)
    PIT0->MOD = PIT0_MOD_INIT;
#endif
#if defined(PIT0_FILT_INIT)
    PIT0->FILT = PIT0_FILT_INIT;
#endif
#if defined(PIT0_CTRL2_INIT)
    PIT0->CTRL2 = PIT0_CTRL2_INIT;
#endif
#if defined(PIT0_CTRL_INIT)
#if ((PIT0_CTRL_INIT & PIT_CTRL_CNT_EN_MASK) != 0)
    PIT0->CTRL = (PIT0_CTRL_INIT & (~PIT_CTRL_CNT_EN_MASK));
    PIT0->CTRL |= PIT_CTRL_CNT_EN_MASK;
#else
    PIT0->CTRL = PIT0_CTRL_INIT;
#endif
#endif
}

/***********************************************************************************************************************
 * TMRA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'TMRA'
- type: 'qtmr_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'qtmr_reg_19ff29c7d66f72ec59fde9c83852e6f9'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'TMRA'
- config_sets:
  - generalConfig:
    - clockSource: 'BusInterfaceClock'
    - clockSourceFreq: 'ClocksTool_DefaultInit'
    - enable_timer_channels:
      - 0:
        - enableTimerChannel: 'true'
      - 1:
        - enableTimerChannel: 'false'
      - 2:
        - enableTimerChannel: 'false'
      - 3:
        - enableTimerChannel: 'false'
    - input_filters:
      - 0:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 1:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 2:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 3:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
    - qtmr_channels:
      - 0:
        - channel: '0'
        - channelConfig:
          - primarySource: '8'
          - secondarySource: '0'
          - inputPolarity: 'false'
          - inputFault: 'false'
          - countingMode: '1'
          - enableCountOnce: 'false'
          - countLength: '0'
          - inputAltLoad: 'false'
          - countDirection: '0'
          - triggeredCountInit: '0'
          - enableMasterMode: 'false'
          - enableExternalForce: 'false'
          - enableCoChannelReinit: 'false'
          - outputMode: '0'
          - forceOutputValue: 'false'
          - forcedOutputValue: '0'
          - outputPolarity: 'false'
          - outputEnabled: 'false'
          - captureMode: '0'
          - reloadOnCapture: 'false'
          - compare1Period: '0'
          - compareLoadControl1: '0'
          - compare2Period: '0'
          - compareLoadControl2: '0'
          - compareLoad1: '0'
          - compareLoad2: '0'
          - counterLoad: '0'
          - counterInit: '0'
          - debugMode: '0'
          - interruptSources:
            - kQTMR_CompareInterruptEnable: 'false'
            - kQTMR_Compare1InterruptEnable: 'false'
            - kQTMR_Compare2InterruptEnable: 'false'
            - kQTMR_OverflowInterruptEnable: 'false'
            - kQTMR_EdgeInterruptEnable: 'false'
          - enable_irq: 'false'
          - interrupt:
            - IRQn: 'kTMRA_0_VECTORn'
            - dsc_enable_interrrupt: 'iprVal0'
            - enable_custom_name: 'false'
          - dma:
            - kQTMR_InputEdgeFlagDmaEnable: 'false'
            - kQTMR_ComparatorPreload1DmaEnable: 'false'
            - kQTMR_ComparatorPreload2DmaEnable: 'false'
        - template_params: []
    - qtmr_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void TMRA_init(void) {
/****************************************************************************/
/* Channel 0 initialization */
/****************************************************************************/
  /* Disable the channel before the module init*/
  TMRA->CHANNEL[0].ENBL &= ~(TMR_ENBL_ENBL(1U << 0));
  TMRA->CHANNEL[0].HOLD = 0x0U;
  TMRA->CHANNEL[0].CAPT = 0x0U;
#ifdef TMRA_COMP10_INIT
  TMRA->CHANNEL[0].COMP1 = TMRA_COMP10_INIT;
#else
  TMRA->CHANNEL[0].COMP1 = 0x0U;
#endif /*TMRA_COMP10_INIT*/
#ifdef TMRA_COMP20_INIT
  TMRA->CHANNEL[0].COMP2 = TMRA_COMP20_INIT;
#else
  TMRA->CHANNEL[0].COMP2 = 0x0U;
#endif /*TMRA_COMP20_INIT */
#ifdef TMRA_LOAD0_INIT
  TMRA->CHANNEL[0].LOAD = TMRA_LOAD0_INIT;
#else
  TMRA->CHANNEL[0].LOAD = 0x0U;
#endif /*TMRA_LOAD0_INIT */
#ifdef TMRA_CNTR0_INIT
  TMRA->CHANNEL[0].CNTR = TMRA_CNTR0_INIT;
#else
  TMRA->CHANNEL[0].CNTR = 0x0U;
#endif /*TMRA_CNTR0_INIT */
#ifdef TMRA_SCTRL0_INIT
  TMRA->CHANNEL[0].SCTRL = TMRA_SCTRL0_INIT;
#else
  TMRA->CHANNEL[0].SCTRL = 0x0U;
#endif /*TMRA_SCTRL0_INIT */
#ifdef TMRA_CMPLD10_INIT
  TMRA->CHANNEL[0].CMPLD1 = TMRA_CMPLD10_INIT;
#else
  TMRA->CHANNEL[0].CMPLD1 = 0x0U;
#endif /*TMRA_CMPLD10_INIT */
#ifdef TMRA_CMPLD20_INIT
  TMRA->CHANNEL[0].CMPLD2 = TMRA_CMPLD20_INIT;
#else
  TMRA->CHANNEL[0].CMPLD2 = 0x0U;
#endif /*TMRA_CMPLD20_INIT */
#ifdef TMRA_CSCTRL0_INIT
  TMRA->CHANNEL[0].CSCTRL = TMRA_CSCTRL0_INIT;
#else
  TMRA->CHANNEL[0].CSCTRL = 0x0U;
#endif /*TMRA_CSCTRL0_INIT */
#ifdef TMRA_DMA0_INIT
  TMRA->CHANNEL[0].DMA = TMRA_DMA0_INIT;
#else
  TMRA->CHANNEL[0].DMA = 0x0U;
#endif /*TMRA_DMA0_INIT */
#ifdef TMRA_CTRL0_INIT
  TMRA->CHANNEL[0].CTRL = TMRA_CTRL0_INIT;
#else
  TMRA->CHANNEL[0].CTRL = 0x0U;
#endif /*TMRA_CTRL0_INIT */
/****************************************************************************/
/* Quad timer global initialization */
/****************************************************************************/
  /* Input filters configuration */
#ifdef TMRA_FILT0_INIT
  TMRA->CHANNEL[0].FILT = TMRA_FILT0_INIT;
#else
  TMRA->CHANNEL[0].FILT = 0x0U;
#endif /*TMRA_FILT0_INIT */
#ifdef TMRA_FILT1_INIT
  TMRA->CHANNEL[1].FILT = TMRA_FILT1_INIT;
#else
  TMRA->CHANNEL[1].FILT = 0x0U;
#endif /*TMRA_FILT1_INIT */
#ifdef TMRA_FILT2_INIT
  TMRA->CHANNEL[2].FILT = TMRA_FILT2_INIT;
#else
  TMRA->CHANNEL[2].FILT = 0x0U;
#endif /*TMRA_FILT2_INIT */
#ifdef TMRA_FILT3_INIT
  TMRA->CHANNEL[3].FILT = TMRA_FILT3_INIT;
#else
  TMRA->CHANNEL[3].FILT = 0x0U;
#endif /*TMRA_FILT3_INIT */
  /* Synchronous start of all channels */
#if defined(TMRA_ENBL_INIT)
   TMRA->CHANNEL[0].ENBL = (TMRA->CHANNEL[0].ENBL & (~TMRA_ENBL_INIT_MASK)) | (TMRA_ENBL_INIT & TMRA_ENBL_INIT_MASK);
#endif /*TMRA_TMRA_ENBL_INIT */
}

