nxp-appcodehub/an-bidirectional-acdc-mc56f83783/Multimode_Bidir_DCAC_LCL_MC56F83783/board/peripherals.c
/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/
static void BOARD_InitPeripherals_CommonPreInit(void)
{
  /* Enable clock gate of the ADC peripheral. */
  SIM->PCE2 |= SIM_PCE2_CYCADC_MASK;
  /* Enable clock gate of the CMPC peripheral. */
  SIM->PCE2 |= SIM_PCE2_CMPC_MASK;
  /* Disable all interrupts to prevent invoking of any interrupt during initialization of peripherals. */
  INTC->CTRL |= INTC_CTRL_INT_DIS_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH0_MASK;
  /* Enable clock gate of the CMPB peripheral. */
  SIM->PCE2 |= SIM_PCE2_CMPB_MASK;
  /* Enable clock gate of the CMPA peripheral. */
  SIM->PCE2 |= SIM_PCE2_CMPA_MASK;
  /* Enable clock gate of the QSCI1 peripheral. */
  SIM->PCE1 |= SIM_PCE1_SCI1_MASK;
  /* Enable clock gate of the PIT0 peripheral. */
  SIM->PCE2 |= SIM_PCE2_PIT0_MASK;
  /* Enable clock gate of the TMRA peripheral. */
  SIM->PCE0 |= SIM_PCE0_TA0_MASK;
}

static void BOARD_InitPeripherals_CommonPostInit(void)
{
  /* Set the interrupt priority: Priority 1 of the keFlexPWMA_CMP0_VECTORn request in the INTC. */
  INTC->IPR9 = (INTC->IPR9 & ~INTC_IPR9_PWMA_CMP0_MASK) | INTC_IPR9_PWMA_CMP0(2);
  /* Set the interrupt priority: Priority 0 of the keFlexPWMA_FAULT_VECTORn request in the INTC. */
  INTC->IPR8 = (INTC->IPR8 & ~INTC_IPR8_PWMA_FAULT_MASK) | INTC_IPR8_PWMA_FAULT(1);
  /* Set the interrupt priority: Priority 0 of the kPIT0_ROLLOVR_VECTORn request in the INTC. */
  INTC->IPR10 = (INTC->IPR10 & ~INTC_IPR10_PIT0_ROLLOVR_MASK) | INTC_IPR10_PIT0_ROLLOVR(1);
  /* Enable all interrupts after initialization of peripherals. */
  INTC->CTRL &= ~INTC_CTRL_INT_DIS_MASK;
  /* Initialization of masked/enabled DSC core interrupt levels. */
  __EI(3);
}

void BOARD_InitPeripherals(void)
{
  /* Common pre-initialization */
  BOARD_InitPeripherals_CommonPreInit();
  /* Initialize components */
  ADC_init();
  CMPC_init();
  PWMA_init();
  CMPB_init();
  CMPA_init();
  QSCI1_init();
  PIT0_init();
  TMRA_init();
  FreeMASTER_init();
  /* Common post-initialization */
  BOARD_InitPeripherals_CommonPostInit();
}

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void)
{
  BOARD_InitPeripherals();
}
